topic/emacs/emacs.org
#+TITLE: Emacs help page for my settings
#+EXPORT_FILE_NAME: ./emacs.html
#+SETUPFILE: https://devlibx.github.io/emacs/org/theams/theme-readtheorg/theme-readtheorg.setup
#+OPTIONS: num:nil

* Setup
This is a custom Emacs setup for my own use. I has the followign setup:

- Download emacs settings
  #+begin_src shell
    mkdir .emacs.d
    git clone https://github.com/devlibx/emacs.git .
#+end_src

- This setup uses doom-emacs theam - you will have to install it
  #+begin_src shell
    # Install doom-emacs:
    M-x package-list-packages => Search for "doom-theams" => Install

    # Note it is possible  you may not see "doom-theams" directly from M-x package-install. So use these steps.
  #+end_src


* Basic Commands
** Navigation
Fast navigation in code -> your can jump in code faster with these keys
#+begin_src shell
  M-e => end of next block
  M-a => begining of next block
  M-+ => Window size increase (Note my keyboard needs shift key to get +) 
  M-_ => Winow size increase  (Note my keyboard needs shift key to gethash _ => it does note need shift to do - and to keep in same I used _)
  M-[ => Horizontally window increase (Note - no shift)
  M-] => Horizontally window reduce (Note - no shift)
#+end_src
** Buffer
#+begin_src shell
  C-x k => Kill buffer
  C-x b => Switch buffer
  C-x o => Jump to next buffer

  M-x kb  => (custom) Kill buffer
  M-x kab => (custom) Kill all buffers

  C-x 0 => Kill this buffer
  C-x 1 => Make current buffer full screen
  C-x 2 => Split Horizontally
  C-x 3 => Split Vertically

#+end_src

* Org Mode
This section describe commands for Org Mode

** Org doc to Html
You can generate a html file out of a Org doc
#+begin_src shell

  # (1) Generate HTML and also open on browser, (2) Generate HTML
  C-c C-e h o
  C-c C-e h h

#+end_src

The Org file needs some formation - so you can used the following to add the css. Add the following content on top of your file
- Edit title
- Give file location to save the html file

#+begin_src shell

  #+TITLE: Emacs help page for my settings
  #+EXPORT_FILE_NAME: ./emacs.html
  #+SETUPFILE: https://devlibx.github.io/emacs/org/theams/theme-readtheorg/theme-readtheorg.setup
  #+OPTIONS: num:nil
  
#+end_src
