topic/emacs/emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-12-12 Tue 14:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs help page for my settings</title>
<meta name="author" content="Harish Bohara" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://devlibx.github.io/emacs/org/theams/theme-readtheorg/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://devlibx.github.io/emacs/org/theams/theme-readtheorg/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Emacs help page for my settings</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7e44a83">Setup</a></li>
<li><a href="#orgcf4cd87">Basic Commands</a>
<ul>
<li><a href="#org9b70e28">Navigation</a></li>
<li><a href="#orgd956e62">Buffer</a></li>
</ul>
</li>
<li><a href="#org8de22f5">Org Mode</a>
<ul>
<li><a href="#org96bf996">Org doc to Html</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org7e44a83" class="outline-2">
<h2 id="org7e44a83">Setup</h2>
<div class="outline-text-2" id="text-org7e44a83">
<p>
This is a custom Emacs setup for my own use. I has the followign setup:
</p>

<ul class="org-ul">
<li><p>
Download emacs settings
</p>
<div class="org-src-container">
<pre class="src src-shell">mkdir .emacs.d
git clone https://github.com/devlibx/emacs.git .
</pre>
</div></li>

<li><p>
This setup uses doom-emacs theam - you will have to install it
</p>
<div class="org-src-container">
<pre class="src src-shell"># Install doom-emacs:
M-x package-list-packages =&gt; Search for "doom-theams" =&gt; Install

# Note it is possible  you may not see "doom-theams" directly from M-x package-install. So use these steps.
</pre>
</div></li>
</ul>
</div>
</div>


<div id="outline-container-orgcf4cd87" class="outline-2">
<h2 id="orgcf4cd87">Basic Commands</h2>
<div class="outline-text-2" id="text-orgcf4cd87">
</div>
<div id="outline-container-org9b70e28" class="outline-3">
<h3 id="org9b70e28">Navigation</h3>
<div class="outline-text-3" id="text-org9b70e28">
<p>
Fast navigation in code -&gt; your can jump in code faster with these keys
</p>
<div class="org-src-container">
<pre class="src src-shell">M-e =&gt; end of next block
M-a =&gt; begining of next block
M-+ =&gt; Window size increase (Note my keyboard needs shift key to get +) 
M-_ =&gt; Winow size increase  (Note my keyboard needs shift key to gethash _ =&gt; it does note need shift to do - and to keep in same I used _)
M-[ =&gt; Horizontally window increase (Note - no shift)
M-] =&gt; Horizontally window reduce (Note - no shift)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd956e62" class="outline-3">
<h3 id="orgd956e62">Buffer</h3>
<div class="outline-text-3" id="text-orgd956e62">
<div class="org-src-container">
<pre class="src src-shell">C-x k =&gt; Kill buffer
C-x b =&gt; Switch buffer
C-x o =&gt; Jump to next buffer

M-x kb  =&gt; (custom) Kill buffer
M-x kab =&gt; (custom) Kill all buffers

C-x 0 =&gt; Kill this buffer
C-x 1 =&gt; Make current buffer full screen
C-x 2 =&gt; Split Horizontally
C-x 3 =&gt; Split Vertically

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8de22f5" class="outline-2">
<h2 id="org8de22f5">Org Mode</h2>
<div class="outline-text-2" id="text-org8de22f5">
<p>
This section describe commands for Org Mode
</p>
</div>

<div id="outline-container-org96bf996" class="outline-3">
<h3 id="org96bf996">Org doc to Html</h3>
<div class="outline-text-3" id="text-org96bf996">
<p>
You can generate a html file out of a Org doc
</p>
<div class="org-src-container">
<pre class="src src-shell">
# (1) Generate HTML and also open on browser, (2) Generate HTML
C-c C-e h o
C-c C-e h h

</pre>
</div>

<p>
The Org file needs some formation - so you can used the following to add the css. Add the following content on top of your file
</p>
<ul class="org-ul">
<li>Edit title</li>
<li>Give file location to save the html file</li>
</ul>

<div class="org-src-container">
<pre class="src src-shell">
#+TITLE: Emacs help page for my settings
#+EXPORT_FILE_NAME: ./emacs.html
#+SETUPFILE: https://devlibx.github.io/emacs/org/theams/theme-readtheorg/theme-readtheorg.setup
#+OPTIONS: num:nil

</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Harish Bohara</p>
<p class="date">Created: 2023-12-12 Tue 14:53</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>